[
  {
    "id": "1",
    "img": "https://example.com/game1.jpg",
    "name": "Space Odyssey",
    "ratings": 4.2,
    "price": 24.99,
    "details": "Embark on a thrilling space adventure, exploring distant galaxies and engaging in epic space battles. Customize your spaceship, discover new planets, and uncover the mysteries of the cosmos."
  },
  {
    "id": "2",
    "img": "https://example.com/game2.jpg",
    "name": "Mystical Quest",
    "ratings": 4.5,
    "price": 29.99,
    "details": "Journey through a magical world filled with mythical creatures, ancient artifacts, and challenging quests. Unlock powerful spells, meet legendary beings, and become the hero of the Mystic Realm."
  },
  {
    "id": "3",
    "img": "https://example.com/game3.jpg",
    "name": "Cybernetic Revolution",
    "ratings": 3.8,
    "price": 39.99,
    "details": "Immerse yourself in a futuristic cyberpunk world. Enhance your body with cybernetic implants, engage in high-stakes hacking missions, and navigate through a city in the midst of a technological revolution."
  },
  {
    "id": "4",
    "img": "https://example.com/game4.jpg",
    "name": "Epic Fantasy Chronicles",
    "ratings": 4.0,
    "price": 19.99,
    "details": "Enter a world of magic, dragons, and ancient prophecies. Choose your character class, embark on epic quests, and battle mythical creatures to save the realm from impending darkness."
  },
  {
    "id": "5",
    "img": "https://example.com/game5.jpg",
    "name": "Stealth Ops: Shadow Infiltration",
    "ratings": 4.7,
    "price": 49.99,
    "details": "Become a master of stealth in this covert operation game. Infiltrate high-security facilities, eliminate targets with precision, and use advanced gadgets to complete dangerous missions in the shadows."
  },
  {
    "id": "6",
    "img": "https://example.com/game6.jpg",
    "name": "Survival Quest: Lost Island",
    "ratings": 3.5,
    "price": 29.99,
    "details": "Stranded on a mysterious island, you must survive against the elements. Hunt for resources, build shelter, and navigate through perilous terrain. Uncover the secrets of the Lost Island and find a way back home."
  }
]
